<a href="https://colab.research.google.com/github/vishwesh5/Simplilearn-Masters/blob/master/Machine_Learning/Practice_Projects/Storing_Test_Results.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Storing Test Results

## DESCRIPTION

From the raw data below, create a data frame:

```
‘first_name’: [‘Jason’, ‘Molly’, ‘Tina’, ‘Jake’, ‘Amy’], ‘last_name’: [‘Miller’, ‘Jacobson’, “.”, ‘Milner’,‘Cooze’],

‘age’: [42, 52, 36, 24, 73], ‘preTestScore’: [4, 24, 31, “.”, “.”],’postTestScore’: [“25,000”, “94,000”, 57, 62, 70]

```

## OBJECTIVE

Perform data processing on the raw data.

## ACTIONS TO PERFORM

- Save the data frame into a .csv file as project.csv
- Read the project.csv file and print the data frame.
- Read the project.csv file without column heading.
- Read the project.csv file and make two index columns, namely, ‘First Name’ and ‘Last Name’.
- Print the data frame in a Boolean form as True or False. True for Null/ NaN values and false for non-null values.
- Read the data frame by skipping the first 3 rows and print the data frame.

In [1]:
# Import modules
import numpy as np
import pandas as pd

In [2]:
data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 'last_name': ['Miller', 'Jacobson', '.', 'Milner','Cooze'],
'age': [42, 52, 36, 24, 73], 
'preTestScore': [4, 24, 31, '.', '.'],
'postTestScore': ['25,000', '94,000', 57, 62, 70]}

In [3]:
# Create a dataframe
df = pd.DataFrame(data)

In [4]:
df

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57
3       Jake    Milner   24            .            62
4        Amy     Cooze   73            .            70

In [5]:
# Save the data frame into a .csv file as project.csv
df.to_csv("project.csv",index=None)

In [6]:
# Check if file is created successfully
!ls

project.csv  sample_data

In [13]:
# Read the project.csv file and print the data frame.
df = pd.read_csv('project.csv')
df

  first_name last_name  age preTestScore postTestScore
0      Jason    Miller   42            4        25,000
1      Molly  Jacobson   52           24        94,000
2       Tina         .   36           31            57
3       Jake    Milner   24            .            62
4        Amy     Cooze   73            .            70

In [12]:
# Read the project.csv file without column heading.
df = pd.read_csv('project.csv',skiprows=1,header=None)
df

       0         1   2   3       4
0  Jason    Miller  42   4  25,000
1  Molly  Jacobson  52  24  94,000
2   Tina         .  36  31      57
3   Jake    Milner  24   .      62
4    Amy     Cooze  73   .      70

In [11]:
# Read the project.csv file and make two index columns, namely, ‘First Name’ and ‘Last Name’.
df = pd.read_csv('project.csv',index_col=["first_name","last_name"])
df

                      age preTestScore postTestScore
first_name last_name
Jason      Miller      42            4        25,000
Molly      Jacobson    52           24        94,000
Tina       .           36           31            57
Jake       Milner      24            .            62
Amy        Cooze       73            .            70

In [18]:
df = pd.read_csv('project.csv')
# Replace "." with np.nan
df = df.replace(".",np.nan)

In [19]:
df.isna()

   first_name  last_name    age  preTestScore  postTestScore
0       False      False  False         False          False
1       False      False  False         False          False
2       False       True  False         False          False
3       False      False  False          True          False
4       False      False  False          True          False

In [20]:
# Read the data frame by skipping the first 3 rows and print the data frame.
df = pd.read_csv('project.csv',skiprows=3,header=None)
df

      0       1   2   3   4
0  Tina       .  36  31  57
1  Jake  Milner  24   .  62
2   Amy   Cooze  73   .  70